In [2]:
import pandas as pd
import numpy as np
from pandas_profiling import ProfileReport
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
df = pd.read_csv('filename.csv')
df_final = pd.read_csv('DF_VF.csv')
df_final.shape

(33287, 25)

In [4]:
profile = ProfileReport(df_final, title="EDA_Datathon")

In [6]:
df_final.head()

,ID,count,Paid,Ratio,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,...,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS,DAYS_BIRTH_CLEAN,Letter,Main_ID,New_ID,ADDRESS
0,5008804,15,13.0,0.866667,M,Y,Y,0.0,427500.0,Working,...,1.0,0.0,0.0,NaN,2.0,09/04/1990,L,5008804,5008804,"06042, CT, 31 Mitchell Road"
1,5008804,15,13.0,0.866667,F,N,Y,1.0,90000.0,State servant,...,0.0,0.0,0.0,Medicine staff,3.0,07/06/1984,L,5008804,5008804,"06042, CT, 31 Mitchell Road"
2,5008805,14,12.0,0.857143,M,Y,Y,0.0,427500.0,Working,...,1.0,0.0,0.0,NaN,2.0,09/04/1990,G,5008805,5008805,"72703, AR, 1189 Northwest End Avenue"
3,5008805,14,12.0,0.857143,M,N,Y,0.0,180000.0,Working,...,0.0,0.0,0.0,Sales staff,2.0,21/02/1995,G,5008805,5008805,"72703, AR, 1189 Northwest End Avenue"
4,5008806,14,7.0,0.500000,M,Y,Y,0.0,112500.0,Working,...,0.0,0.0,0.0,Security staff,2.0,06/05/1964,D,5008806,5008806,"72701, AR, 218 Shipley Alley"

In [7]:
profile

Summarize dataset:   0%|          | 0/5 [00:00<?, ?it/s]

Generate report structure:   0%|          | 0/1 [00:00<?, ?it/s]

Render HTML:   0%|          | 0/1 [00:00<?, ?it/s]

In [ ]:
df_final.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33287 entries, 0 to 33286
Data columns (total 25 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   33287 non-null  int64
 1   count                33287 non-null  int64
 2   Paid                 18049 non-null  float64
 3   Ratio                18049 non-null  float64
 4   CODE_GENDER          32470 non-null  object
 5   FLAG_OWN_CAR         32464 non-null  object
 6   FLAG_OWN_REALTY      32461 non-null  object
 7   CNT_CHILDREN         32474 non-null  float64
 8   AMT_INCOME_TOTAL     32485 non-null  float64
 9   NAME_INCOME_TYPE     32442 non-null  object
 10  NAME_EDUCATION_TYPE  32438 non-null  object
 11  NAME_FAMILY_STATUS   32479 non-null  object
 12  NAME_HOUSING_TYPE    32464 non-null  object
 13  DAYS_EMPLOYED        32450 non-null  float64
 14  FLAG_MOBIL           32495 non-null  float64
 15  FLAG_WORK_PHONE      32469 non-null  float64
 16  FLAG_PHONE           32413 non-null  float64
 17  FLAG_EMAIL           32468 non-null  float64
 18  OCCUPATION_TYPE      22293 non-null  object
 19  CNT_FAM_MEMBERS      32524 non-null  float64
 20  DAYS_BIRTH_CLEAN     32480 non-null  object
 21  Letter               33287 non-null  object
 22  Main_ID              33287 non-null  int64
 23  New_ID               33287 non-null  int64
 24  ADDRESS              33287 non-null  object
dtypes: float64(10), int64(4), object(11)
memory usage: 6.3+ MB

In [ ]:
numeric_df = df_final.select_dtypes(include=[np.number])
categorical_df = df_final.select_dtypes(exclude=[np.number])
print(numeric_df.head())
print(categorical_df.head())

        ID  count  Paid     Ratio  CNT_CHILDREN  AMT_INCOME_TOTAL  \
0  5008804     15  13.0  0.866667           0.0          427500.0
1  5008804     15  13.0  0.866667           1.0           90000.0
2  5008805     14  12.0  0.857143           0.0          427500.0
3  5008805     14  12.0  0.857143           0.0          180000.0
4  5008806     14   7.0  0.500000           0.0          112500.0

   DAYS_EMPLOYED  FLAG_MOBIL  FLAG_WORK_PHONE  FLAG_PHONE  FLAG_EMAIL  \
0        -4542.0         1.0              1.0         0.0         0.0
1        -3659.0         1.0              0.0         0.0         0.0
2        -4542.0         1.0              1.0         0.0         0.0
3         -390.0         1.0              0.0         0.0         0.0
4        -1134.0         1.0              0.0         0.0         0.0

   CNT_FAM_MEMBERS  Main_ID   New_ID
0              2.0  5008804  5008804
1              3.0  5008804  5008804
2              2.0  5008805  5008805
3              2.0  5008805  5008805
4              2.0  5008806  5008806
  CODE_GENDER FLAG_OWN_CAR FLAG_OWN_REALTY NAME_INCOME_TYPE  \
0           M            Y               Y          Working
1           F            N               Y    State servant
2           M            Y               Y          Working
3           M            N               Y          Working
4           M            Y               Y          Working

             NAME_EDUCATION_TYPE NAME_FAMILY_STATUS  NAME_HOUSING_TYPE  \
0               Higher education     Civil marriage   Rented apartment
1  Secondary / secondary special            Married  House / apartment
2               Higher education     Civil marriage   Rented apartment
3               Higher education     Civil marriage       With parents
4  Secondary / secondary special            Married  House / apartment

  OCCUPATION_TYPE DAYS_BIRTH_CLEAN Letter  \
0             NaN       09/04/1990      L
1  Medicine staff       07/06/1984      L
2             NaN       09/04/1990      G
3     Sales staff       21/02/1995      G
4  Security staff       06/05/1964      D

                                ADDRESS
0           06042, CT, 31 Mitchell Road
1           06042, CT, 31 Mitchell Road
2  72703, AR, 1189 Northwest End Avenue
3  72703, AR, 1189 Northwest End Avenue
4          72701, AR, 218 Shipley Alley

In [ ]:
numeric_df['CNT_CHILDREN']

0        0.0
1        1.0
2        0.0
3        0.0
4        0.0
        ...
33282    1.0
33283    1.0
33284    NaN
33285    1.0
33286    0.0
Name: CNT_CHILDREN, Length: 33287, dtype: float64

In [ ]:
plt.figure(figsize = [26, 7])
#
# univariate plots of cut, color, and clarity grades
plt.subplot(1, 3, 1)
sns.boxplot(data=df_final, x='CNT_CHILDREN', y=df_final['CNT_CHILDREN'].count());
plt.xlabel('Cut Quality')

plt.subplot(1, 3, 2)
sb.boxplot(data=diamonds, x='color', y='carat',  order= ['J', 'I', 'H', 'G', 'F', 'E', 'D']);
plt.xlabel('Color Quality')

plt.subplot(1, 3, 3)
sb.boxplot(data=diamonds, x='clarity', y='carat', order= ['I1', 'SI2', 'SI1', 'VS2', 'VS1', 'VVS2', 'VVS1', 'IF']);
plt.xlabel('Clarity Quality')

## Utilizando el Modelo en el Negocio

Aplicar el modelo a la base de dados, para generar el Scoring. despues com la base ya con el SCORING (probabilidad que occura el evento) aplicamos la funcion abajo para separar-los en rangos de probabilidad de del evento y asÃ­ definir que rango os ortogariamos la gratuidad automaticamiente y cuales seria denegados automaticamiente.

In [ ]:
def RankScore(input_score_df,nm_score,targetname,bins):
    input_score_df['score'] = input_score_df[nm_score]
    input_score_df['rank'] = pd.cut(input_score_df[nm_score], bins, labels=False)
    df7 = input_score_df.groupby('rank').agg({targetname: np.mean, 'rank': np.size})
    df7['id_ranks']=df7.index
    df7['tx_evento']=df7[targetname]
    df7['qt_rank']=df7['rank']
    df7 = df7.drop(['rank',targetname],axis=1)
    df7 = df7.reset_index()
    df_ord_score = df7.drop(['rank'],axis=1) 
    return df_ord_score

In [ ]:
df_rank = RankScore(ABT_SCORED,'Score','Survived',bins=10)

In [ ]:
df_rank

In [ ]:
# Libraries
import numpy as np
import matplotlib.pyplot as plt

# Make a random dataset:
height = df_rank.tx_evento
bars = df_rank.id_ranks
y_pos = np.arange(len(bars))

plt.figure(figsize=(12, 7))
plt.rcParams.update({'font.size': 15})
# Create bars
plt.bar(y_pos, height)

# Create names on the x-axis
plt.xticks(y_pos, bars)

# setting label of y-axis
plt.ylabel("Taxa de Evento")
 
# setting label of x-axis
plt.xlabel("Faixas de Score")
plt.title("OrdenaÃ§Ã£o do Score")

# Show graphic
plt.show()